<a href="https://colab.research.google.com/github/Rayzon3/DBMS/blob/master/Practice_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('MyDataBase.db')
cur = conn.cursor()

In [5]:
#Creating b.Tech table
conn.execute('''
              CREATE TABLE IF NOT EXISTS bTech_Table(
                id INTEGER PRIMARY KEY AUTOINCREMENT,
                name TEXT NOT NULL,
                group_name TEXT NOT NULL,
                marks_mse INTEGER NOT NULL,
                marks_final INTEGER NOT NULL 
              )
''')

In [13]:
def insertData(id, name, group_name, marks_mse, marks_final):
  query = "INSERT INTO btech_table Values(?, ?, ?, ?, ?)"
  cur.execute(query, (id, name, group_name, marks_mse, marks_final))
  conn.commit()

In [14]:
insertData(1234, "Asuna", "T1", 19, 58)

In [24]:
insertData(3242, "Chizuru", "T1", 17, 52)

In [26]:
query = "SELECT * FROM btech_table"
pd.read_sql(query, conn)

     id     name group_name  marks_mse  marks_final
0  1234    Asuna         T1         19           58
1  3242  Chizuru         T1         17           52

In [27]:
insertData(6753, "Kirito", "T2", 18, 57)
insertData(8657, "Hotaro", "T2", 16, 51)

In [28]:
query = "SELECT * FROM btech_table"
pd.read_sql(query, conn)

     id     name group_name  marks_mse  marks_final
0  1234    Asuna         T1         19           58
1  3242  Chizuru         T1         17           52
2  6753   Kirito         T2         18           57
3  8657   Hotaro         T2         16           51

In [31]:
#creating m.tech table
conn.execute('''CREATE TABLE IF NOT EXISTS mtech_table(
                  id INTEGER PRIMARY KEY AUTOINCREMENT,
                  name TEXT NOT NULL,
                  group_name TEXT NOT NULL,
                  marks_mse INTEGER NOT NULL,
                  marks_final INTEGER NOT NULL   
)''')

In [32]:
def insert(id, name, group_name, marks_mse, marks_final):
  query = "INSERT INTO mtech_table Values(?, ?, ?, ?, ?)"
  cur.execute(query, (id, name, group_name, marks_mse, marks_final))
  conn.commit()

In [33]:
insert(1236, "Chika", "T1", 15, 60)

In [34]:
query = "SELECT * FROM mtech_table"
pd.read_sql(query, conn)

     id   name group_name  marks_mse  marks_final
0  1236  Chika         T1         15           60

In [35]:
insert(6755, "Yuki", "T1", 13, 45)
insert(7668, "Nicky", "T2", 15, 55)
insert(9762, "Ruka", "T2", 12, 52)

In [36]:
query = "SELECT * FROM mtech_table"
pd.read_sql(query, conn)

     id   name group_name  marks_mse  marks_final
0  1236  Chika         T1         15           60
1  6755   Yuki         T1         13           45
2  7668  Nicky         T2         15           55
3  9762   Ruka         T2         12           52

In [37]:
from IPython.display import display

In [39]:
print("B.Tech Students")
display(pd.read_sql("SELECT * FROM btech_table", conn))

print("M.Tech Students")
display(pd.read_sql("SELECT * FROM mtech_table", conn))

B.Tech Students

     id     name group_name  marks_mse  marks_final
0  1234    Asuna         T1         19           58
1  3242  Chizuru         T1         17           52
2  6753   Kirito         T2         18           57
3  8657   Hotaro         T2         16           51

M.Tech Students

     id   name group_name  marks_mse  marks_final
0  1236  Chika         T1         15           60
1  6755   Yuki         T1         13           45
2  7668  Nicky         T2         15           55
3  9762   Ruka         T2         12           52

In [40]:
#total number of students in b.tech table
query = "SELECT COUNT(*) FROM btech_table"
pd.read_sql(query, conn)

   COUNT(*)
0         4

In [41]:
#list all T2 students in m.tech
query = "SELECT * FROM mtech_table WHERE group_name = 'T2'"
pd.read_sql(query, conn)

     id   name group_name  marks_mse  marks_final
0  7668  Nicky         T2         15           55
1  9762   Ruka         T2         12           52

In [43]:
#number of T1 and T2 students in b.tech
query = "SELECT group_name, COUNT(*) FROM btech_table GROUP BY group_name"
pd.read_sql(query, conn)

  group_name  COUNT(*)
0         T1         2
1         T2         2

In [45]:
query = "UPDATE mtech_table SET group_name = 'T1' WHERE group_name = 'T2'"
cur.execute(query)
query = "SELECT * FROM mtech_table"
pd.read_sql(query, conn)

     id   name group_name  marks_mse  marks_final
0  1236  Chika         T1         15           60
1  6755   Yuki         T1         13           45
2  7668  Nicky         T1         15           55
3  9762   Ruka         T1         12           52

In [46]:
#average marks in b.tech

query = "SELECT AVG(marks_mse), AVG(marks_final) FROM btech_table"
pd.read_sql(query, conn)

   AVG(marks_mse)  AVG(marks_final)
0            17.5              54.5